import type { Notification } from "../types";

export const notifications: Notification[] = [
  {
    id: 1,
    title: "عنوان اطلاعیه شماره یک",
    message:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.",
    color: "bg-warning",
  },
  {
    id: 2,
    title: "عنوان اطلاعیه شماره دو",
    message:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.",
    color: "bg-gray-400",
  },
  {
    id: 3,
    title: "عنوان اطلاعیه شماره سه",
    message:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.",
    color: "bg-warning",
  },
];
