import type { Notification } from "../types/notification";

const loremText =
  "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می‌باشد.";

export const notifications: Notification[] = [
  {
    id: 1,
    title: "لورم ایپسوم متن تستی جهت نمایش عنوان",
    message: "۲۲ ساعت پیش",
    fullText: loremText,
    time: "۱۴:۲۲",
    date: "۱۴۰۲/۰۹/۲۵",
    isRead: false,
  },
  {
    id: 2,
    title: "سفارش شما با موفقیت ثبت شد",
    message: "۵ ساعت پیش",
    fullText:
      "سفارش شما با شماره #143513538 با موفقیت در سیستم ثبت شد و در حال پردازش می‌باشد. همکاران ما به زودی برای هماهنگی ارسال با شما تماس خواهند گرفت. از خرید شما سپاسگزاریم.",
    time: "۰۹:۱۵",
    date: "۱۴۰۲/۰۹/۲۵",
    isRead: false,
  },
  {
    id: 3,
    title: "تیکت جدیدی برای شما ثبت شد",
    message: "۱ روز پیش",
    fullText:
      "تیکت جدیدی با موضوع «مشکل در پرداخت آنلاین» برای شما ثبت شد. کارشناسان پشتیبانی ما به زودی پاسخ شما را بررسی و ارائه خواهند کرد. لطفاً تا آن زمان صبور باشید.",
    time: "۱۶:۴۵",
    date: "۱۴۰۲/۰۹/۲۴",
    isRead: false,
  },
  {
    id: 4,
    title: "پرداخت شما با موفقیت انجام شد",
    message: "۳ روز پیش",
    fullText:
      "پرداخت شما به مبلغ ۲۵۶,۰۰۰ تومان با موفقیت انجام شد. فاکتور رسمی برای شما ارسال خواهد شد. از اعتماد شما به Vizion سپاسگزاریم.",
    time: "۱۳:۲۰",
    date: "۱۴۰۲/۰۹/۲۲",
    isRead: true,
  },
  {
    id: 5,
    title: "بروزرسانی جدید سیستم",
    message: "۱ هفته پیش",
    fullText:
      "سیستم Vizion به نسخه جدید بروزرسانی شد. در این نسخه، سرعت بارگذاری بهبود یافته و چند قابلیت جدید به پنل کاربری اضافه شده است. برای اطلاعات بیشتر به بخش راهنما مراجعه کنید.",
    time: "۱۸:۰۰",
    date: "۱۴۰۲/۰۹/۱۸",
    isRead: true,
  },
  {
    id: 6,
    title: "خوش‌آمدگویی به Vizion",
    message: "۲ هفته پیش",
    fullText:
      "به Vizion خوش آمدید! از این پس می‌توانید سفارشات خود را مدیریت کنید، تیکت پشتیبانی ثبت کنید، و از تخفیف‌های ویژه کاربران استفاده کنید.",
    time: "۱۱:۱۱",
    date: "۱۴۰۲/۰۹/۱۱",
    isRead: true,
  },
  {
    id: 7,
    title: "تخفیف ویژه پایان فصل",
    message: "۳ هفته پیش",
    fullText:
      "به مناسبت پایان فصل، تخفیف ویژه‌ای برای تمامی محصولات در نظر گرفته‌ایم. با کد تخفیف VIZION25 از ۲۵٪ تخفیف روی خریدهای خود بهره‌مند شوید.",
    time: "۰۸:۳۰",
    date: "۱۴۰۲/۰۹/۰۴",
    isRead: true,
  },
  {
    id: 8,
    title: "یادآوری: اتمام اعتبار اشتراک",
    message: "۱ ماه پیش",
    fullText:
      "اشتراک شما تا ۳ روز دیگر به پایان می‌رسد. برای جلوگیری از قطع دسترسی به سرویس‌ها، لطفاً نسبت به تمدید اشتراک خود اقدام کنید.",
    time: "۱۰:۳۰",
    date: "۱۴۰۲/۰۸/۲۵",
    isRead: true,
  },
  {
    id: 9,
    title: "تخفیف ویژه پایان فصل",
    message: "۳ هفته پیش",
    fullText:
      "به مناسبت پایان فصل، تخفیف ویژه‌ای برای تمامی محصولات در نظر گرفته‌ایم. با کد تخفیف VIZION25 از ۲۵٪ تخفیف روی خریدهای خود بهره‌مند شوید.",
    time: "۰۸:۳۰",
    date: "۱۴۰۲/۰۹/۰۴",
    isRead: true,
  },
  {
    id: 10,
    title: "یادآوری: اتمام اعتبار اشتراک",
    message: "۱ ماه پیش",
    fullText:
      "اشتراک شما تا ۳ روز دیگر به پایان می‌رسد. برای جلوگیری از قطع دسترسی به سرویس‌ها، لطفاً نسبت به تمدید اشتراک خود اقدام کنید.",
    time: "۱۰:۳۰",
    date: "۱۴۰۲/۰۸/۲۵",
    isRead: true,
  },
  {
    id: 11,
    title: "تخفیف ویژه پایان فصل",
    message: "۳ هفته پیش",
    fullText:
      "به مناسبت پایان فصل، تخفیف ویژه‌ای برای تمامی محصولات در نظر گرفته‌ایم. با کد تخفیف VIZION25 از ۲۵٪ تخفیف روی خریدهای خود بهره‌مند شوید.",
    time: "۰۸:۳۰",
    date: "۱۴۰۲/۰۹/۰۴",
    isRead: true,
  },
  {
    id: 12,
    title: "یادآوری: اتمام اعتبار اشتراک",
    message: "۱ ماه پیش",
    fullText:
      "اشتراک شما تا ۳ روز دیگر به پایان می‌رسد. برای جلوگیری از قطع دسترسی به سرویس‌ها، لطفاً نسبت به تمدید اشتراک خود اقدام کنید.",
    time: "۱۰:۳۰",
    date: "۱۴۰۲/۰۸/۲۵",
    isRead: true,
  },
  {
    id: 13,
    title: "تخفیف ویژه پایان فصل",
    message: "۳ هفته پیش",
    fullText:
      "به مناسبت پایان فصل، تخفیف ویژه‌ای برای تمامی محصولات در نظر گرفته‌ایم. با کد تخفیف VIZION25 از ۲۵٪ تخفیف روی خریدهای خود بهره‌مند شوید.",
    time: "۰۸:۳۰",
    date: "۱۴۰۲/۰۹/۰۴",
    isRead: false,
  },
  {
    id: 14,
    title: "یادآوری: اتمام اعتبار اشتراک",
    message: "۱ ماه پیش",
    fullText:
      "اشتراک شما تا ۳ روز دیگر به پایان می‌رسد. برای جلوگیری از قطع دسترسی به سرویس‌ها، لطفاً نسبت به تمدید اشتراک خود اقدام کنید.",
    time: "۱۰:۳۰",
    date: "۱۴۰۲/۰۸/۲۵",
    isRead: false,
  },
  {
    id: 15,
    title: "تخفیف ویژه پایان فصل",
    message: "۳ هفته پیش",
    fullText:
      "به مناسبت پایان فصل، تخفیف ویژه‌ای برای تمامی محصولات در نظر گرفته‌ایم. با کد تخفیف VIZION25 از ۲۵٪ تخفیف روی خریدهای خود بهره‌مند شوید.",
    time: "۰۸:۳۰",
    date: "۱۴۰۲/۰۹/۰۴",
    isRead: false,
  },
  {
    id: 16,
    title: "یادآوری: اتمام اعتبار اشتراک",
    message: "۱ ماه پیش",
    fullText:
      "اشتراک شما تا ۳ روز دیگر به پایان می‌رسد. برای جلوگیری از قطع دسترسی به سرویس‌ها، لطفاً نسبت به تمدید اشتراک خود اقدام کنید.",
    time: "۱۰:۳۰",
    date: "۱۴۰۲/۰۸/۲۵",
    isRead: false,
  },
  {
    id: 17,
    title: "تخفیف ویژه پایان فصل",
    message: "۳ هفته پیش",
    fullText:
      "به مناسبت پایان فصل، تخفیف ویژه‌ای برای تمامی محصولات در نظر گرفته‌ایم. با کد تخفیف VIZION25 از ۲۵٪ تخفیف روی خریدهای خود بهره‌مند شوید.",
    time: "۰۸:۳۰",
    date: "۱۴۰۲/۰۹/۰۴",
    isRead: false,
  },
  {
    id: 18,
    title: "یادآوری: اتمام اعتبار اشتراک",
    message: "۱ ماه پیش",
    fullText:
      "اشتراک شما تا ۳ روز دیگر به پایان می‌رسد. برای جلوگیری از قطع دسترسی به سرویس‌ها، لطفاً نسبت به تمدید اشتراک خود اقدام کنید.",
    time: "۱۰:۳۰",
    date: "۱۴۰۲/۰۸/۲۵",
    isRead: false,
  },
];
